# ColumnTopAttachCutParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ColumnTopAttachCutParam Property
ParameterTypeId Class See Also
---
"Top Attachment Cut"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ColumnTopAttachCutParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ColumnTopAttachCutParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ColumnTopAttachCutParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace